/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   shell.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yait-kad <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/20 14:40:13 by yait-kad          #+#    #+#             */
/*   Updated: 2021/03/20 14:40:16 by yait-kad         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void    banner()
{
    ft_putstr_fd("\e[1;32m ██████   ██████ █████ ██████   █████ █████  █████████  █████   █████ ██████████ █████       █████      \e[0m\n",1);
    ft_putstr_fd("\e[1;32m░░██████ ██████ ░░███ ░░██████ ░░███ ░░███  ███░░░░░███░░███   ░░███ ░░███░░░░░█░░███       ░░███       \e[0m\n",1);
    ft_putstr_fd("\e[1;32m ░███░█████░███  ░███  ░███░███ ░███  ░███ ░███    ░░░  ░███    ░███  ░███  █ ░  ░███        ░███       \e[0m\n",1);
    ft_putstr_fd("\e[1;32m ░███░░███ ░███  ░███  ░███░░███░███  ░███ ░░█████████  ░███████████  ░██████    ░███        ░███       \e[0m\n",1);
    ft_putstr_fd("\e[1;32m ░███ ░░░  ░███  ░███  ░███ ░░██████  ░███  ░░░░░░░░███ ░███░░░░░███  ░███░░█    ░███        ░███       \e[0m\n",1);
    ft_putstr_fd("\e[1;32m ░███      ░███  ░███  ░███  ░░█████  ░███  ███    ░███ ░███    ░███  ░███ ░   █ ░███      █ ░███      █\e[0m\n",1);
    ft_putstr_fd("\e[1;32m █████     █████ █████ █████  ░░█████ █████░░█████████  █████   █████ ██████████ ███████████ ███████████\e[0m\n",1);
    ft_putstr_fd("\e[1;32m░░░░░     ░░░░░ ░░░░░ ░░░░░    ░░░░░ ░░░░░  ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░░░░░░ ░░░░░░░░░░░ ░░░░░░░░░░░ \e[0m\n",1);
}

void    prompt()
{
   
    ft_putstr_fd("\033[0;36mMy_Minishell $>\e[0m", 0);
}

// void    exec()
// {
//     while (curr_cmd)
//     {
//         expanding();
//         if (curr_cmd->sp == pipe)
//         {

//         }
//         else
//         {
            
//         }
        
//     }
// }

// int ac ,char **av, char **env
int     main(int argc, char **argv, char **env)
{
    t_token_list *var;
    t_command *cmd = NULL;
    t_env *lenv;
    char *line;
    int r;
    int syntax_rslt;

    (void)argc;
    (void)argv;
    var = NULL;
    line = NULL;
    lenv = NULL;
    banner();
    lenv = create_env_list(lenv, env);
    while (1)
    {
        prompt();
        r = get_next_line(0, &line);
        if (r > 0)
        {
           // ft_putstr_fd(line, 0);
		    write(1, "\n",1);
        }
        var = ft_lexer(line);
        display_token(var);
        syntax_rslt = check_syntax_error(var);
        if (syntax_rslt != 1)
        {
            cmd = ft_parce(var);
            //expanding();
            expanding(cmd, lenv);
            //exec();
            display_commands(cmd);
        }

        if (ft_strcmp((const char*)line,"exit") == 0)
        {
            free(line);
            break;
        }
    }
    return 0;
}
